src/cf/InformationRegisters/СостоянияДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеДополнение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МыИКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодписывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоМы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВзаимозачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСтроительныхРаботУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ведомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУКД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУПД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОбОшибкеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОператораЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеКАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетОферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПроизвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальноеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправленияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>НаправленияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
					<Comment>Внутри организации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияЭДОДокументооборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СостоянияЭДОДокументооборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытПринудительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытСОтклонением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЗавершенСИсправлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСозданияПакетаЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяИсправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждениеАннулирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставленВОчередьНаОтправку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяАннулировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяУточнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ИнтерфейсЭДОДокументооборот/Ext/Module.bsl
// @strict-types


#Область ПрограммныйИнтерфейс

// Обновляет параметры формы, необходимые для работы по ЭДО, при необходимости создает реквизиты формы
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, имеющая следующие реквизиты. Если реквизитов нет, создаются программно:
//    * ВариантПодписания - ПеречислениеСсылка.ВариантыПодписания
//    * ЕстьЭДО - Булево
//    * ПодписанЭДО - Булево
//    * ТипДокументаЭДО - ПеречислениеСсылка.ТипыДокументовЭДО
//    * НаправлениеЭДО - ПеречислениеСсылка.НаправленияЭДО
//    * СостояниеПоЭДО - ПеречислениеСсылка.СостоянияЭДОДокументооборот
//    * ДоступнаКорректировкаЭД - Булево
//    * ИдентификаторПакетаЭДО - УникальныйИдентификатор
//    * МожноМенятьПакетЭДО - Булево
//    * ПоддерживаетсяПакетнаяОбработкаЭДО - Булево
//    * ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
//                                      Документ ЭДО, связанный с переданным параметром ДокументДО
//    * ПакетЭДОНеОтражен - Булево
//    * УчетнаяЗаписьЭДО - Строка - Идентификатор учетной записи, которой будет обменян документ
//    * СертификатыДляЭДО - ТаблицаЗначений:
//      ** ДоступенДляЭДО - Булево
//      ** Отпечаток - Строка
//      ** Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//      ** ДоступенНаКлиенте - Булево
//      ** ДоступенНаСервере - Булево
//  ДокументДО - ОпределяемыйТип.ДокументДОДляЭДО - Документ ДО, над которым будут выполняться действия ЭДО
//
Процедура ЗаполнитьПараметрыФормыПоЭДО(Форма, ДокументДО) Экспорт
	
	СоздатьРеквизитыПоЭДОПриНеобходимости(Форма);
	
	СброситьПараметрыФормыПоЭДО(Форма);
	
	Если Не ЗначениеЗаполнено(ДокументДО) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБЭД.ЗначениеФункциональнойОпции("ИспользоватьОбменЭД") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ВариантПодписания = Перечисления.ВариантыПодписания.НеПодписывается Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЭДО = ОбменСКонтрагентамиДОСлужебный.ПараметрыДокументаПоЭДО(ДокументДО); // см. ОбменСКонтрагентамиДОСлужебный.ПараметрыДокументаПоЭДО
	
	ЗаполнитьТаблицуСертификатов(ДокументДО, ПараметрыЭДО, Форма);
	
	Если ЗначениеЗаполнено(ПараметрыЭДО) Тогда
		
		Форма.ЕстьЭДО = Истина;
		
		Форма.ТипДокументаЭДО = ?(Не ЗначениеЗаполнено(ПараметрыЭДО.ТипДокументаЭДО),
			Перечисления.ТипыДокументовЭДО.Прочее,
			ПараметрыЭДО.ТипДокументаЭДО);
		Форма.НаправлениеЭДО = ПараметрыЭДО.Направление;
		Форма.СостояниеПоЭДО = ПараметрыЭДО.СостояниеДО;
		Форма.ПодписанЭДО = ПараметрыЭДО.Подписан;
		Форма.ДоступнаКорректировкаЭД = ПараметрыЭДО.ДоступнаКорректировкаЭД;
		Форма.ДокументЭДО = ПараметрыЭДО.ЭлектронныйДокумент;
		Форма.УчетнаяЗаписьЭДО = ПараметрыЭДО.УчетнаяЗаписьЭДО;
		
		Форма.ИдентификаторПакетаЭДО = ПараметрыЭДО.ПакетЭДО;
		Форма.МожноМенятьПакетЭДО = ПараметрыЭДО.ДоступноИзменениеПакетаЭДО;
		Форма.ПоддерживаетсяПакетнаяОбработкаЭДО = ПараметрыЭДО.ПоддерживаетсяПакетнаОбработка;
		Форма.ПакетЭДОНеОтражен = ПараметрыЭДО.ПакетЭДОНеОтражен;
		
	КонецЕсли;
	
КонецПроцедуры

#Область КомандыЭДО

#Область Перечисления

Функция ОбластиКомандЭДО() Экспорт
	
	ОбластиКоманд = Новый Структура;
	ОбластиКоманд.Вставить("РаботаСПакетом", "РаботаСПакетом");
	ОбластиКоманд.Вставить("ДействияЭДО", "ДействияЭДО");
	
	Возврат ОбластиКоманд;
	
КонецФункции

Функция ОбъектыЭДО() Экспорт
	
	ОбъектыЭДО = Новый Структура;
	ОбъектыЭДО.Вставить("Документ", "Документ");
	ОбъектыЭДО.Вставить("Пакет", "Пакет");
	
	Возврат ОбъектыЭДО;
	
КонецФункции

Функция ДействияКомандЭДО() Экспорт
	
	ДействияЭДО = Новый Структура;
	ДействияЭДО.Вставить("Принять", "Принять");
	ДействияЭДО.Вставить("Отклонить", "Отклонить");
	ДействияЭДО.Вставить("Подписать", "Подписать");
	ДействияЭДО.Вставить("Отправить", "Отправить");
	ДействияЭДО.Вставить("ЗакрытьПринудительно", "ЗакрытьПринудительно");
	ДействияЭДО.Вставить("ПоставитьВОчередьОтправки", "ПоставитьВОчередьОтправки");
	ДействияЭДО.Вставить("Аннулировать", "Аннулировать");
	
	Возврат ДействияЭДО;
	
КонецФункции

Функция ДействияСПакетомЭДО() Экспорт
	
	ДействияСПакетом = Новый Структура;
	ДействияСПакетом.Вставить("СоздатьПакет", "СоздатьПакет");
	ДействияСПакетом.Вставить("ДобавитьКПакету", "ДобавитьКПакету");
	ДействияСПакетом.Вставить("ИзменитьСоставПакета", "ИзменитьСоставПакета");
	ДействияСПакетом.Вставить("ОткрытьПакет", "ОткрытьПакет");
	
	Возврат ДействияСПакетом;
	
КонецФункции

Функция ДопустимыеНаправленияЭДО() Экспорт
	
	ДопустимыеНаправления = Новый Структура;
	ДопустимыеНаправления.Вставить("Исходящий", "Исходящий");
	ДопустимыеНаправления.Вставить("Входящий", "Входящий");
	
	Возврат ДопустимыеНаправления;
	
КонецФункции

#КонецОбласти

// Новое описание команды по ЭДО.
// 
// Возвращаемое значение:
//  Структура - Новое описание команды по ЭДО:
//    * Область - Строка - Одно из значений структуры см. ОбластиКомандЭДО
//    * Объект - Строка - Одно из значений структуры см. ОбъектыЭДО
//    * ВыполняемыеДействия - Соответствие Из КлючИЗначение:
//      ** Ключ - Строка - Одно из значений структур см. ДействияКомандЭДО или см. ДействияСПакетомЭДО
//      ** Значение - Булево - Истина, если действие доступно
//    * НаправленияОбъекта - Соответствие Из КлючИЗначение:
//      ** Ключ - Строка - Одно из значений структуры см. ДопустимыеНаправленияЭДО
//      ** Значение - Булево - Истина, если команда доступна для направлений
//    * СкрыватьВОднородномПакете - Булево - Истина, если для документа в однородном состоянии пакета
//                                           нужно скрывать команду. Имеет смысл только для входящих документов.
//
Функция НовоеОписаниеКомандыПоЭДО() Экспорт
	
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("Область", "");
	ОписаниеКоманды.Вставить("Объект", "");
	ОписаниеКоманды.Вставить("ВыполняемыеДействия", Новый Соответствие());
	ОписаниеКоманды.Вставить("НаправленияОбъекта", Новый Соответствие());
	ОписаниеКоманды.Вставить("СкрыватьВОднородномПакете", Истина);
	
	Возврат ОписаниеКоманды;
	
КонецФункции

// Новое описание команд ЭДО.
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    * Ключ - КнопкаФормы - Команда
//    * Значение - см. НовоеОписаниеКомандыПоЭДО
//
Функция НовоеОписаниеКомандЭДО() Экспорт
	
	ОписаниеКоманд = Новый Соответствие();
	Возврат ОписаниеКоманд;
	
КонецФункции

// Шаблоны команд ЭДО.
// 
// Возвращаемое значение:
//  Структура - Шаблоны команд ЭДО:
//    * РаботаСПакетом - Структура:
//      ** СоздатьПакетЭДО - см. НовоеОписаниеКомандыПоЭДО
//      ** ДобавитьКПакету - см. НовоеОписаниеКомандыПоЭДО
//      ** ИзменитьСоставПакета - см. НовоеОписаниеКомандыПоЭДО
//      ** ОткрытьПакет - см. НовоеОписаниеКомандыПоЭДО
//    * ДействияЭДО - Структура:
//      ** ОбработкаВходящих - Структура:
//        *** ПринятьДокумент - см. НовоеОписаниеКомандыПоЭДО
//        *** ПринятьПакет - см. НовоеОписаниеКомандыПоЭДО
//        *** ОтклонитьДокумент - см. НовоеОписаниеКомандыПоЭДО
//        *** ОтклонитьПакет - см. НовоеОписаниеКомандыПоЭДО
//      ** ОбработкаИсходящих - Структура:
//        *** ПодписатьДокумент - см. НовоеОписаниеКомандыПоЭДО
//        *** ПодписатьИОтправитьДокумент см. НовоеОписаниеКомандыПоЭДО
//        *** ОтправитьДокумент - см. НовоеОписаниеКомандыПоЭДО
//        *** ПодписатьПакет - см. НовоеОписаниеКомандыПоЭДО
//        *** ПодписатьИОтправитьПакет - см. НовоеОписаниеКомандыПоЭДО
//        *** ОтправитьПакет - см. НовоеОписаниеКомандыПоЭДО
//      ** ПрочиеДействия - Структура:
//        *** ЗакрытьПринудительно - см. НовоеОписаниеКомандыПоЭДО
//        *** ПоставитьВОчередьОтправки - см. НовоеОписаниеКомандыПоЭДО
//        *** Аннулировать - см. НовоеОписаниеКомандыПоЭДО
//
Функция ШаблоныКомандЭДО() Экспорт
	
	ШаблоныКоманд = Новый Структура;
	
	ШаблоныКоманд.Вставить("РаботаСПакетом", ШаблоныКомандПакетов());
	ШаблоныКоманд.Вставить("ДействияЭДО", ШаблоныКомандДействийЭДО());
	
	Возврат ШаблоныКоманд;
	
КонецФункции

// Устанавливает видимость и доступность команд ЭДО на форме
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * ЕстьЭДО - Булево
//    * ПодписанЭДО - Булево
//    * ТипДокументаЭДО - ПеречислениеСсылка.ТипыДокументовЭДО
//    * НаправлениеЭДО - ПеречислениеСсылка.НаправленияЭДО
//    * СостояниеПоЭДО - ПеречислениеСсылка.СостоянияЭДОДокументооборот
//    * ДоступнаКорректировкаЭД - Булево
//    * ИдентификаторПакетаЭДО - УникальныйИдентификатор
//    * МожноМенятьПакетЭДО - Булево
//    * ПоддерживаетсяПакетнаяОбработкаЭДО - Булево
//    * ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
//                                      Документ ЭДО, связанный с документом ДО на форме
//    * ПакетЭДОНеОтражен - Булево
//    * УчетнаяЗаписьЭДО - Строка - Идентификатор учетной записи, которой будет обменян документ
//    * СертификатыДляЭДО - ТаблицаЗначений:
//      ** ДоступенДляЭДО - Булево
//      ** Отпечаток - Строка
//      ** Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//      ** ДоступенНаКлиенте - Булево
//      ** ДоступенНаСервере - Булево
//  ОписаниеКоманд - см. НовоеОписаниеКомандЭДО
//
Процедура УстановитьВидимостьДоступностьКомандЭДО(Форма, ОписаниеКоманд) Экспорт
	
	СнятьВидимостьВсехКоманд(ОписаниеКоманд);
	
	Если Не Форма.ЕстьЭДО
		Или Не СинхронизацияЭДО.ЕстьПравоВыполненияОбмена() Тогда
		
		Возврат;
	КонецЕсли;
	
	ВключитьВидимостьКомандРаботыСПакетом(Форма, ОписаниеКоманд);
	
	Если Форма.НаправлениеЭДО = Перечисления.НаправленияЭДО.Исходящий Тогда
		
		ВключитьВидимостьКомандПоИсходящим(Форма, ОписаниеКоманд);
		
	Иначе
		
		ВключитьВидимостьКомандПоВходящим(Форма, ОписаниеКоманд);
		
	КонецЕсли;
	
	ОбменСКонтрагентамиДОСобытия.ПриУстановкеВидимостиДоступностиКомандЭДО(Форма, ОписаниеКоманд);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает видимость и доступность команд ЭДО по отбору
// 
// Параметры:
//  ОписаниеКоманд - см. НовоеОписаниеКомандЭДО
//  Отбор - см. НовыйОтборКомандЭДО
//  Видимость - Булево
//  Доступность - Булево
//
Процедура УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Видимость, Доступность) Экспорт
	
	ЭлементыКомандСоответствующиеОтбору = Новый Массив(); // Массив из КнопкаФормы
	
	Для Каждого Элемент Из ОписаниеКоманд Цикл
		
		ЭлементКоманды = Элемент.Ключ;
		ОписаниеКоманды = Элемент.Значение;
		
		Если КомандаСоответствуетОтбору(ОписаниеКоманды, Отбор) Тогда
			ЭлементыКомандСоответствующиеОтбору.Добавить(ЭлементКоманды);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементКоманды Из ЭлементыКомандСоответствующиеОтбору Цикл
		УстановитьВидимостьДоступностьЭлементаФормы(ЭлементКоманды, Видимость, Доступность);
	КонецЦикла;
	
КонецПроцедуры

// Новый отбор команд ЭДО, объединяет элементы отбора по И
// 
// Возвращаемое значение:
//  Массив из см. НовыйЭлементОтбораКомандЭДО
Функция НовыйОтборКомандЭДО() Экспорт
	
	ЭлементыОтбора = Новый Массив;
	Возврат ЭлементыОтбора;
	
КонецФункции

// Создает новый элемент отбора команд
// 
// Возвращаемое значение:
//  Структура:
//    * ВидЭлемента - Строка - Одно из значений перечисления см. ВидыЭлементовОтбораКомандЭДО
//    * ДочерниеЭлементы - Массив из Структура - см. НовыйЭлементОтбораКомандЭДО, Дочерние элементы. Актуальны для групп
//    * Ключ - Строка - Один из ключей описания команды см. НовоеОписаниеКомандыПоЭДО
//    * ВидСравнения - Строка - Оно из значений см. ВидыСравненияЭлементовОтбораКомандЭДО
//    * Значение - Строка, Булево - Значение ключа описания команды
//
Функция НовыйЭлементОтбораКомандЭДО() Экспорт
	
	ЭлементОтбора = Новый Структура;
	
	ЭлементОтбора.Вставить("ВидЭлемента", ВидыЭлементовОтбораКомандЭДО().Элемент);
	ЭлементОтбора.Вставить("ДочерниеЭлементы", Новый Массив);
	
	ЭлементОтбора.Вставить("Ключ", "");
	ЭлементОтбора.Вставить("ВидСравнения", ВидыСравненияЭлементовОтбораКомандЭДО().Равно);
	ЭлементОтбора.Вставить("Значение", "");
	
	Возврат ЭлементОтбора;
	
КонецФункции

Функция ВидыЭлементовОтбораКомандЭДО() Экспорт
	
	ВидыЭлементов = Новый Структура;
	ВидыЭлементов.Вставить("Элемент", "Элемент");
	ВидыЭлементов.Вставить("ГруппаПоИ", "ГруппаПоИ");
	ВидыЭлементов.Вставить("ГруппаПоИли", "ГруппаПоИли");
	
	Возврат ВидыЭлементов;
	
КонецФункции

// Возвращает возможные виды сравнения для отбора команд
// 
// Возвращаемое значение:
//  Структура - Перечисление видов сравнения:
//    * Равно - Строка - Только для ключей "Область", "Объект", "СкрыватьВОднородномПакете"
//    * НеРавно - Строка - Только для ключей "Область", "Объект", "СкрыватьВОднородномПакете"
//    * Содержит - Строка - Только для ключей "ВыполняемыеДействия", "НаправленияОбъекта"
//    * НеСодержит - Строка - Только для ключей "ВыполняемыеДействия", "НаправленияОбъекта"
//
Функция ВидыСравненияЭлементовОтбораКомандЭДО() Экспорт
	
	ВидыСравнения = Новый Структура;
	ВидыСравнения.Вставить("Равно", "Равно");
	ВидыСравнения.Вставить("НеРавно", "НеРавно");
	ВидыСравнения.Вставить("Содержит", "Содержит");
	ВидыСравнения.Вставить("НеСодержит", "НеСодержит");
	
	Возврат ВидыСравнения;
	
КонецФункции

Функция КлючиОтбораКомандЭДО() Экспорт
	
	КлючиОтбора = Новый Структура;
	КлючиОтбора.Вставить("Область", "Область");
	КлючиОтбора.Вставить("Объект", "Объект");
	КлючиОтбора.Вставить("ВыполняемыеДействия", "ВыполняемыеДействия");
	КлючиОтбора.Вставить("НаправленияОбъекта", "НаправленияОбъекта");
	КлючиОтбора.Вставить("СкрыватьВОднородномПакете", "СкрыватьВОднородномПакете");
	
	Возврат КлючиОтбора;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеПараметровФормыПоЭДО

#Область СозданиеРеквизитовФормы

Процедура СоздатьРеквизитыПоЭДОПриНеобходимости(Форма)
	
	НеобходимыеРеквизиты = НеобходимыеРеквизитыДляЭДО();
	ДобавляемыеРеквизиты = Новый Массив; // Массив Из РеквизитФормы
	
	Для Каждого Реквизит Из НеобходимыеРеквизиты Цикл
		
		Если ЕстьРеквизитФормы(Форма, Реквизит) Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
			Реквизит.Имя, Реквизит.Тип, Реквизит.Путь, Реквизит.Заголовок, Реквизит.СохраняемыеДанные));
		
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, );
	
КонецПроцедуры

Функция ЕстьРеквизитФормы(Форма, Реквизит)
	
	Если Не ЗначениеЗаполнено(Реквизит.Путь) Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, Реквизит.Имя);
	КонецЕсли;
	
	РеквизитыТаблицы = Форма.ПолучитьРеквизиты(Реквизит.Путь);
	
	Для Каждого Элемент Из РеквизитыТаблицы Цикл
		Если Элемент.Имя = Реквизит.Имя Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Необходимые реквизиты для ЭДО.
// 
// Возвращаемое значение:
//  Массив Из см. НовоеОписаниеРеквизита
//
Функция НеобходимыеРеквизитыДляЭДО()
	
	НеобходимыеРеквизиты = Новый Массив; // Массив из см. НовоеОписаниеРеквизита
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ЕстьЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ПодписанЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ТипДокументаЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДокументовЭДО");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "НаправлениеЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.НаправленияЭДО");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "СостояниеПоЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭДОДокументооборот");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ДоступнаКорректировкаЭД";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ИдентификаторПакетаЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("УникальныйИдентификатор");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "МожноМенятьПакетЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ПоддерживаетсяПакетнаяОбработкаЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ДокументЭДО";
	Реквизит.Тип = ОписаниеТипаДокументаЭДО();
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ПакетЭДОНеОтражен";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НеобходимыеРеквизиты,
		РеквизитыТаблицыСертификатов());
	
	Возврат НеобходимыеРеквизиты;
	
КонецФункции

Функция ОписаниеТипаДокументаЭДО()
	
	Типы = Новый Массив; // Массив Из Тип
	Типы.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО"));
	Типы.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО"));
	
	Возврат Новый ОписаниеТипов(Типы);
	
КонецФункции

Функция РеквизитыТаблицыСертификатов()
	
	НеобходимыеРеквизиты = Новый Массив; // Массив из см. НовоеОписаниеРеквизита
	
	ИмяТаблицыСертификатов = "СертификатыДляЭДО";
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ДоступенДляЭДО";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	Реквизит.Путь = ИмяТаблицыСертификатов;
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "Отпечаток";
	Реквизит.Тип = Новый ОписаниеТипов("Строка");
	Реквизит.Путь = ИмяТаблицыСертификатов;
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "Доверенность";
	Реквизит.Тип = Метаданные.ОпределяемыеТипы.МашиночитаемаяДоверенность.Тип;
	Реквизит.Путь = ИмяТаблицыСертификатов;
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ДоступенНаКлиенте";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	Реквизит.Путь = ИмяТаблицыСертификатов;
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Реквизит = НовоеОписаниеРеквизита();
	Реквизит.Имя = "ДоступенНаСервере";
	Реквизит.Тип = Новый ОписаниеТипов("Булево");
	Реквизит.Путь = ИмяТаблицыСертификатов;
	НеобходимыеРеквизиты.Добавить(Реквизит);
	
	Возврат НеобходимыеРеквизиты;
	
КонецФункции

// Новое описание реквизита.
// 
// Возвращаемое значение:
//  Структура - Новое описание реквизита:
// * Имя - Строка
// * Тип - ОписаниеТипов
// * Путь - Строка
// * Заголовок - Строка
// * СохраняемыеДанные - Булево
Функция НовоеОписаниеРеквизита()
	
	ОписаниеРеквизита = Новый Структура;
	ОписаниеРеквизита.Вставить("Имя", "");
	ОписаниеРеквизита.Вставить("Тип", Новый ОписаниеТипов);
	ОписаниеРеквизита.Вставить("Путь", "");
	ОписаниеРеквизита.Вставить("Заголовок", "");
	ОписаниеРеквизита.Вставить("СохраняемыеДанные", Ложь);
	
	Возврат ОписаниеРеквизита;
	
КонецФункции

#КонецОбласти

Процедура СброситьПараметрыФормыПоЭДО(Форма)
	
	Форма.ЕстьЭДО = Ложь;
		
	Форма.ТипДокументаЭДО = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
	Форма.НаправлениеЭДО = Перечисления.НаправленияЭДО.ПустаяСсылка();
	Форма.СостояниеПоЭДО = Перечисления.СостоянияЭДОДокументооборот.ПустаяСсылка();
	Форма.ПодписанЭДО = Ложь;
	Форма.ДоступнаКорректировкаЭД = Ложь;
	Форма.ДокументЭДО = Документы.ЭлектронныйДокументВходящийЭДО.ПустаяСсылка();
	
	Форма.ИдентификаторПакетаЭДО = УникальныйИдентификаторПустой();
	Форма.МожноМенятьПакетЭДО = Ложь;
	Форма.ПоддерживаетсяПакетнаяОбработкаЭДО = Ложь;
	Форма.ПакетЭДОНеОтражен = Ложь;
	
	Для Каждого Строка Из Форма.СертификатыДляЭДО Цикл
		Строка.ДоступенДляЭДО = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#Область ЗаполнениеТаблицыСертификатов

Процедура ЗаполнитьТаблицуСертификатов(ДокументДО, ПараметрыЭДО, Форма)
	
	ЗаполнитьДоступностьСертификатовПоЭДО(ДокументДО, ПараметрыЭДО, Форма);
	
	ЗаполнитьДоступностьСертификатовНаСервере(Форма);
	
КонецПроцедуры

Процедура ЗаполнитьДоступностьСертификатовПоЭДО(ДокументДО, ПараметрыЭДО, Форма)
	
	Для Каждого Строка Из Форма.СертификатыДляЭДО Цикл
		Строка.ДоступенДляЭДО = Ложь;
	КонецЦикла;
	
	Если ПараметрыЭДО = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИДУчетнойЗаписи = Неопределено;
	
	Если ПараметрыЭДО.ЕстьЭД И ЗначениеЗаполнено(ПараметрыЭДО.ЭлектронныйДокумент) Тогда
		
		ИДУчетнойЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ПараметрыЭДО.ЭлектронныйДокумент, "ИдентификаторОрганизации");
		
	Иначе
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДокументДО, "Организация, Контрагент");
		
		ВидДокументаПрочее = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(
			Перечисления.ТипыДокументовЭДО.Прочее);
		
		ВидДокументаЭДО = ?(ЗначениеЗаполнено(ПараметрыЭДО.ВидДокументаЭДО),
			ПараметрыЭДО.ВидДокументаЭДО,
			ВидДокументаПрочее);
		
		КлючНастроекОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
		КлючНастроекОтправки.Отправитель = РеквизитыДокумента.Организация;
		КлючНастроекОтправки.Получатель = РеквизитыДокумента.Контрагент;
		КлючНастроекОтправки.ВидДокумента = ВидДокументаЭДО;
		
		НастройкаОтправки = НастройкиЭДО.НастройкиОтправки(КлючНастроекОтправки);
		
		Если НастройкаОтправки <> Неопределено Тогда
			ИДУчетнойЗаписи = НастройкаОтправки.ИдентификаторОтправителя;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИДУчетнойЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСертификатов = ВыборкаСертификатовПоУчетнойЗаписи(ИДУчетнойЗаписи);
	
	Пока ВыборкаСертификатов.Следующий() Цикл
		
		ОтборСертификата = Новый Структура("Отпечаток", ВыборкаСертификатов.Отпечаток);
		СтрокиСуществующие = Форма.СертификатыДляЭДО.НайтиСтроки(ОтборСертификата);
		
		Если СтрокиСуществующие.Количество() = 0 Тогда
			
			НоваяСтрока = Форма.СертификатыДляЭДО.Добавить();
			НоваяСтрока.Отпечаток = ВыборкаСертификатов.Отпечаток;
			НоваяСтрока.ДоступенДляЭДО = Истина;
			НоваяСтрока.Доверенность = ВыборкаСертификатов.Доверенность;
			
		Иначе
			
			Для Каждого СтрокаСуществующая Из СтрокиСуществующие Цикл
				СтрокаСуществующая.ДоступенДляЭДО = Истина;
				СтрокаСуществующая.Доверенность = ВыборкаСертификатов.Доверенность;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выборка сертификатов по учетной записи.
// 
// Параметры:
//  ИДУчетнойЗаписи - Строка, Неопределено - ИДУчетной записи
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//    * Отпечаток - Строка
//    * Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//
Функция ВыборкаСертификатовПоУчетнойЗаписи(ИДУчетнойЗаписи)
	
	ОтборСертификатов = УчетныеЗаписиЭДО.НовыйОтборСертификатовУчетныхЗаписей();
	ОтборСертификатов.УчетныеЗаписи = "&Идентификаторы";
	ОтборСертификатов.ТолькоДействительные = Истина;
	
	Запросы = Новый Массив; // Массив Из см. ОбщегоНазначенияБЭД.НовоеОписаниеЗапроса
	Запросы.Добавить(УчетныеЗаписиЭДО.ЗапросСертификатовУчетныхЗаписей(
		"СертификатыУчетныхЗаписей", ОтборСертификатов));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СертификатыУчетныхЗаписей.Сертификат КАК Сертификат,
		|	СертификатыУчетныхЗаписей.Сертификат.Отпечаток КАК Отпечаток,
		|	СертификатыУчетныхЗаписей.Доверенность КАК Доверенность
		|ИЗ
		|	СертификатыУчетныхЗаписей КАК СертификатыУчетныхЗаписей";
	
	ИтоговыйЗапрос = ОбщегоНазначенияБЭД.СоединитьЗапросы(Запрос, Запросы);
	ИтоговыйЗапрос.УстановитьПараметр("Идентификаторы", ИДУчетнойЗаписи);
	
	РезультатЗапроса = ИтоговыйЗапрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Процедура ЗаполнитьДоступностьСертификатовНаСервере(Форма)
	
	Для Каждого Строка Из Форма.СертификатыДляЭДО Цикл
		Строка.ДоступенНаСервере = Ложь;
	КонецЦикла;
	
	Если Не ЭлектроннаяПодпись.СоздаватьЭлектронныеПодписиНаСервере() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("ПолучениеСертификатов", Ложь);
	
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов(
		ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	
	ВсеСертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	
	Для Каждого Сертификат Из ВсеСертификаты Цикл
		
		Отпечаток = Base64Строка(Сертификат.Отпечаток);
		
		ОтборСертификата = Новый Структура("Отпечаток", Отпечаток);
		СтрокиСуществующие = Форма.СертификатыДляЭДО.НайтиСтроки(ОтборСертификата);
		
		Если СтрокиСуществующие.Количество() = 0 Тогда
			
			НоваяСтрока = Форма.СертификатыДляЭДО.Добавить();
			НоваяСтрока.Отпечаток = Отпечаток;
			НоваяСтрока.ДоступенНаСервере = Истина;
			
		Иначе
			
			Для Каждого СтрокаСуществующая Из СтрокиСуществующие Цикл
				СтрокаСуществующая.ДоступенНаСервере = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КомандыЭДО

#Область ШаблоныКоманд

Функция ШаблоныКомандПакетов()
	
	КомандыПакетов = Новый Структура();
	
	СоздатьПакет = НовоеОписаниеКомандыПоЭДО();
	СоздатьПакет.Область = ОбластиКомандЭДО().РаботаСПакетом;
	СоздатьПакет.Объект = ОбъектыЭДО().Документ;
	СоздатьПакет.ВыполняемыеДействия[ДействияСПакетомЭДО().СоздатьПакет] = Истина;
	СоздатьПакет.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыПакетов.Вставить("СоздатьПакетЭДО", СоздатьПакет);
	
	ДобавитьКПакету = НовоеОписаниеКомандыПоЭДО();
	ДобавитьКПакету.Область = ОбластиКомандЭДО().РаботаСПакетом;
	ДобавитьКПакету.Объект = ОбъектыЭДО().Документ;
	ДобавитьКПакету.ВыполняемыеДействия[ДействияСПакетомЭДО().ДобавитьКПакету] = Истина;
	ДобавитьКПакету.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыПакетов.Вставить("ДобавитьКПакету", ДобавитьКПакету);
	
	ИзменитьСоставПакета = НовоеОписаниеКомандыПоЭДО();
	ИзменитьСоставПакета.Область = ОбластиКомандЭДО().РаботаСПакетом;
	ИзменитьСоставПакета.Объект = ОбъектыЭДО().Документ;
	ИзменитьСоставПакета.ВыполняемыеДействия[ДействияСПакетомЭДО().ИзменитьСоставПакета] = Истина;
	ИзменитьСоставПакета.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыПакетов.Вставить("ИзменитьСоставПакета", ИзменитьСоставПакета);
	
	ОткрытьПакет = НовоеОписаниеКомандыПоЭДО();
	ОткрытьПакет.Область = ОбластиКомандЭДО().РаботаСПакетом;
	ОткрытьПакет.Объект = ОбъектыЭДО().Документ;
	ОткрытьПакет.ВыполняемыеДействия[ДействияСПакетомЭДО().ОткрытьПакет] = Истина;
	ИзменитьСоставПакета.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	ИзменитьСоставПакета.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	
	КомандыПакетов.Вставить("ОткрытьПакет", ОткрытьПакет);
	
	Возврат КомандыПакетов;
	
КонецФункции

Функция ШаблоныКомандДействийЭДО()
	
	РазделыКоманд = Новый Структура();
	
	РазделыКоманд.Вставить("ОбработкаВходящих", ШаблоныКомандОбработкиВходящих());
	РазделыКоманд.Вставить("ОбработкаИсходящих", ШаблоныКомандОбработкиИсходящих());
	РазделыКоманд.Вставить("ПрочиеДействия", ШаблоныКомандПрочихДействийЭДО());
	
	Возврат РазделыКоманд;
	
КонецФункции

Функция ШаблоныКомандОбработкиВходящих()
	
	КомандыВходящих = Новый Структура();
	
	ПринятьДокумент = НовоеОписаниеКомандыПоЭДО();
	ПринятьДокумент.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПринятьДокумент.Объект = ОбъектыЭДО().Документ;
	ПринятьДокумент.ВыполняемыеДействия[ДействияКомандЭДО().Принять] = Истина;
	ПринятьДокумент.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	ПринятьДокумент.СкрыватьВОднородномПакете = Истина;
	
	КомандыВходящих.Вставить("ПринятьДокумент", ПринятьДокумент);
	
	ПринятьПакет = НовоеОписаниеКомандыПоЭДО();
	ПринятьПакет.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПринятьПакет.Объект = ОбъектыЭДО().Пакет;
	ПринятьПакет.ВыполняемыеДействия[ДействияКомандЭДО().Принять] = Истина;
	ПринятьПакет.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	
	КомандыВходящих.Вставить("ПринятьПакет", ПринятьПакет);
	
	ОтклонитьДокумент = НовоеОписаниеКомандыПоЭДО();
	ОтклонитьДокумент.Область = ОбластиКомандЭДО().ДействияЭДО;
	ОтклонитьДокумент.Объект = ОбъектыЭДО().Документ;
	ОтклонитьДокумент.ВыполняемыеДействия[ДействияКомандЭДО().Отклонить] = Истина;
	ОтклонитьДокумент.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	ОтклонитьДокумент.СкрыватьВОднородномПакете = Истина;
	
	КомандыВходящих.Вставить("ОтклонитьДокумент", ОтклонитьДокумент);
	
	ОтклонитьПакет = НовоеОписаниеКомандыПоЭДО();
	ОтклонитьПакет.Область = ОбластиКомандЭДО().ДействияЭДО;
	ОтклонитьПакет.Объект = ОбъектыЭДО().Пакет;
	ОтклонитьПакет.ВыполняемыеДействия[ДействияКомандЭДО().Отклонить] = Истина;
	ОтклонитьПакет.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	ОтклонитьПакет.СкрыватьВОднородномПакете = Истина;
	
	КомандыВходящих.Вставить("ОтклонитьПакет", ОтклонитьПакет);
	
	Возврат КомандыВходящих;
	
КонецФункции

Функция ШаблоныКомандОбработкиИсходящих()
	
	КомандыИсходящих = Новый Структура();
	
	ПодписатьДокумент = НовоеОписаниеКомандыПоЭДО();
	ПодписатьДокумент.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПодписатьДокумент.Объект = ОбъектыЭДО().Документ;
	ПодписатьДокумент.ВыполняемыеДействия[ДействияКомандЭДО().Подписать] = Истина;
	ПодписатьДокумент.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыИсходящих.Вставить("ПодписатьДокумент", ПодписатьДокумент);
	
	ПодписатьИОтправитьДокумент = НовоеОписаниеКомандыПоЭДО();
	ПодписатьИОтправитьДокумент.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПодписатьИОтправитьДокумент.Объект = ОбъектыЭДО().Документ;
	ПодписатьИОтправитьДокумент.ВыполняемыеДействия[ДействияКомандЭДО().Подписать] = Истина;
	ПодписатьИОтправитьДокумент.ВыполняемыеДействия[ДействияКомандЭДО().Отправить] = Истина;
	ПодписатьИОтправитьДокумент.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыИсходящих.Вставить("ПодписатьИОтправитьДокумент", ПодписатьИОтправитьДокумент);
	
	ОтправитьДокумент = НовоеОписаниеКомандыПоЭДО();
	ОтправитьДокумент.Область = ОбластиКомандЭДО().ДействияЭДО;
	ОтправитьДокумент.Объект = ОбъектыЭДО().Документ;
	ОтправитьДокумент.ВыполняемыеДействия[ДействияКомандЭДО().Отправить] = Истина;
	ОтправитьДокумент.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыИсходящих.Вставить("ОтправитьДокумент", ОтправитьДокумент);
	
	ПодписатьПакет = НовоеОписаниеКомандыПоЭДО();
	ПодписатьПакет.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПодписатьПакет.Объект = ОбъектыЭДО().Пакет;
	ПодписатьПакет.ВыполняемыеДействия[ДействияКомандЭДО().Подписать] = Истина;
	ПодписатьПакет.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыИсходящих.Вставить("ПодписатьПакет", ПодписатьПакет);
	
	ПодписатьИОтправитьПакет = НовоеОписаниеКомандыПоЭДО();
	ПодписатьИОтправитьПакет.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПодписатьИОтправитьПакет.Объект = ОбъектыЭДО().Пакет;
	ПодписатьИОтправитьПакет.ВыполняемыеДействия[ДействияКомандЭДО().Подписать] = Истина;
	ПодписатьИОтправитьПакет.ВыполняемыеДействия[ДействияКомандЭДО().Отправить] = Истина;
	ПодписатьИОтправитьПакет.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыИсходящих.Вставить("ПодписатьИОтправитьПакет", ПодписатьИОтправитьПакет);
	
	ОтправитьПакет = НовоеОписаниеКомандыПоЭДО();
	ОтправитьПакет.Область = ОбластиКомандЭДО().ДействияЭДО;
	ОтправитьПакет.Объект = ОбъектыЭДО().Пакет;
	ОтправитьПакет.ВыполняемыеДействия[ДействияКомандЭДО().Отправить] = Истина;
	ОтправитьПакет.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	
	КомандыИсходящих.Вставить("ОтправитьПакет", ОтправитьПакет);
	
	Возврат КомандыИсходящих;
	
КонецФункции

Функция ШаблоныКомандПрочихДействийЭДО()
	
	ПрочиеКоманды = Новый Структура;
	
	ЗакрытьПринудительно = НовоеОписаниеКомандыПоЭДО();
	ЗакрытьПринудительно.Область = ОбластиКомандЭДО().ДействияЭДО;
	ЗакрытьПринудительно.Объект = ОбъектыЭДО().Документ;
	ЗакрытьПринудительно.ВыполняемыеДействия[ДействияКомандЭДО().ЗакрытьПринудительно] = Истина;
	ЗакрытьПринудительно.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	ЗакрытьПринудительно.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	
	ПрочиеКоманды.Вставить("ЗакрытьПринудительно", ЗакрытьПринудительно);
	
	ПоставитьВОчередьОтправки = НовоеОписаниеКомандыПоЭДО();
	ПоставитьВОчередьОтправки.Область = ОбластиКомандЭДО().ДействияЭДО;
	ПоставитьВОчередьОтправки.Объект = ОбъектыЭДО().Документ;
	ПоставитьВОчередьОтправки.ВыполняемыеДействия[ДействияКомандЭДО().ПоставитьВОчередьОтправки] = Истина;
	ПоставитьВОчередьОтправки.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	ПоставитьВОчередьОтправки.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	
	ПрочиеКоманды.Вставить("ПоставитьВОчередьОтправки", ПоставитьВОчередьОтправки);
	
	Аннулировать = НовоеОписаниеКомандыПоЭДО();
	Аннулировать.Область = ОбластиКомандЭДО().ДействияЭДО;
	Аннулировать.Объект = ОбъектыЭДО().Документ;
	Аннулировать.ВыполняемыеДействия[ДействияКомандЭДО().Аннулировать] = Истина;
	Аннулировать.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Исходящий] = Истина;
	Аннулировать.НаправленияОбъекта[ДопустимыеНаправленияЭДО().Входящий] = Истина;
	
	ПрочиеКоманды.Вставить("Аннулировать", Аннулировать);
	
	Возврат ПрочиеКоманды;
	
КонецФункции

#КонецОбласти

Процедура СнятьВидимостьВсехКоманд(ОписаниеКоманд)
	
	Для Каждого Элемент Из ОписаниеКоманд Цикл
		
		ЭлементФормы = Элемент.Ключ;
		
		УстановитьВидимостьДоступностьЭлементаФормы(ЭлементФормы, Ложь, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьВидимостьДоступностьЭлементаФормы(Элемент, Видимость, Доступность)
	
	Элемент.Видимость = Видимость;
	Элемент.Доступность = Доступность;
	
КонецПроцедуры

#Область УстановкаВидимостиИДоступностиКомандЭДО

#Область КомандыРаботыСПакетом

Процедура ВключитьВидимостьКомандРаботыСПакетом(Форма, ОписаниеКоманд)
	
	Если ЗначениеЗаполнено(Форма.ИдентификаторПакетаЭДО) Тогда
		
		Отбор = ОтборПоДействиюОткрытьПакет();
		УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
		
	КонецЕсли;
	
	Если Не Форма.ПоддерживаетсяПакетнаяОбработкаЭДО
		Или Форма.НаправлениеЭДО <> Перечисления.НаправленияЭДО.Исходящий
		Или Не СостояниеПозволяетИзменятьСоставПакета(Форма.СостояниеПоЭДО) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ИдентификаторПакетаЭДО) Тогда
		
		Если Не Форма.МожноМенятьПакетЭДО Тогда
			Возврат;
		КонецЕсли;
		
		Отбор = ОтборПоДействиюИзменитьСоставПакета();
		УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
		
	Иначе
		
		Отбор = ОтборПоДействиямСозданияПакетаИДобавленияКПакету();
		УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция СостояниеПозволяетИзменятьСоставПакета(СостояниеЭДО)
	
	Возврат СостояниеЭДО = Перечисления.СостоянияЭДОДокументооборот.НеСформирован
		Или СостояниеЭДО = Перечисления.СостоянияЭДОДокументооборот.Подписан
		Или СостояниеЭДО = Перечисления.СостоянияЭДОДокументооборот.ОжидаетсяОтправка
		Или СостояниеЭДО = Перечисления.СостоянияЭДОДокументооборот.ОжидаетСозданияПакетаЭДО;
	
КонецФункции

Функция ОтборПоДействиюОткрытьПакет()
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Область;
	ЭлементОтбора.Значение = ОбластиКомандЭДО().РаботаСПакетом;
	Отбор.Добавить(ЭлементОтбора);
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДействияСПакетомЭДО().ОткрытьПакет;
	Отбор.Добавить(ЭлементОтбора);
	
	Возврат Отбор;
	
КонецФункции

Функция ОтборПоДействиюИзменитьСоставПакета()
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Область;
	ЭлементОтбора.Значение = ОбластиКомандЭДО().РаботаСПакетом;
	Отбор.Добавить(ЭлементОтбора);
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДействияСПакетомЭДО().ИзменитьСоставПакета;
	Отбор.Добавить(ЭлементОтбора);
	
	Возврат Отбор;
	
КонецФункции

Функция ОтборПоДействиямСозданияПакетаИДобавленияКПакету()
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Область;
	ЭлементОтбора.Значение = ОбластиКомандЭДО().РаботаСПакетом;
	Отбор.Добавить(ЭлементОтбора);
	
	ГруппаДействий = НовыйЭлементОтбораКомандЭДО();
	ГруппаДействий.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИли;
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДействияСПакетомЭДО().СоздатьПакет;
	ГруппаДействий.ДочерниеЭлементы.Добавить(ЭлементОтбора);
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДействияСПакетомЭДО().ДобавитьКПакету;
	ГруппаДействий.ДочерниеЭлементы.Добавить(ЭлементОтбора);
	
	Отбор.Добавить(ГруппаДействий);
	
	Возврат Отбор;
	
КонецФункции

#КонецОбласти

#Область ИсходящиеДокументы

Процедура ВключитьВидимостьКомандПоИсходящим(Форма, ОписаниеКоманд)
	
	Если ЗначениеЗаполнено(Форма.ИдентификаторПакетаЭДО) Тогда
		ВключитьВидимостьКомандОтправкиПоИсходящемуПакету(Форма, ОписаниеКоманд);
	Иначе
		ВключитьВидимостьКомандОтправкиПоИсходящемуОдиночномуДокументу(Форма, ОписаниеКоманд);
	КонецЕсли;
	
	ВключитьВидимостьПрочихКомандИсходящегоДокумента(Форма, ОписаниеКоманд);
	
КонецПроцедуры

Процедура ВключитьВидимостьКомандОтправкиПоИсходящемуОдиночномуДокументу(Форма, ОписаниеКоманд)
	
	Если Не СостояниеДокументаЭДОПригодноДляОтправки(Форма.СостояниеПоЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = ОтборКомандОтправкиПоСостояниюЭДОИсходящегоДокумента(Форма.СостояниеПоЭДО);
	
	УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
	
КонецПроцедуры

Функция СостояниеДокументаЭДОПригодноДляОтправки(Состояние)
	
	Возврат Состояние = Перечисления.СостоянияЭДОДокументооборот.НеСформирован
		Или Состояние = Перечисления.СостоянияЭДОДокументооборот.Подписан
		Или Состояние = Перечисления.СостоянияЭДОДокументооборот.ПоставленВОчередьНаОтправку
		Или Состояние = Перечисления.СостоянияЭДОДокументооборот.ОжидаетсяОтправка;
	
КонецФункции

Функция ОтборКомандОтправкиПоСостояниюЭДОИсходящегоДокумента(Состояние)
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().НаправленияОбъекта;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДопустимыеНаправленияЭДО().Исходящий;
	Отбор.Добавить(ЭлементОтбора);
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Объект;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно;
	ЭлементОтбора.Значение = ОбъектыЭДО().Документ;
	Отбор.Добавить(ЭлементОтбора);
	
	ВозможныеСостояния = Перечисления.СостоянияЭДОДокументооборот;
	
	Если Состояние = ВозможныеСостояния.НеСформирован Тогда
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Подписать;
		Отбор.Добавить(ЭлементОтбора);
		
	ИначеЕсли Состояние = ВозможныеСостояния.Подписан
		Или Состояние = ВозможныеСостояния.ПоставленВОчередьНаОтправку
		Или Состояние = ВозможныеСостояния.ОжидаетсяОтправка Тогда
		
		ГруппаОтбора = НовыйЭлементОтбораКомандЭДО();
		ГруппаОтбора.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИ;
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().НеСодержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Подписать;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Отправить;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
		Отбор.Добавить(ГруппаОтбора);
		
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

Процедура ВключитьВидимостьКомандОтправкиПоИсходящемуПакету(Форма, ОписаниеКоманд)
	
	НаборСостоянийДокументов = НаборСостоянийДокументовПакета(Форма.ИдентификаторПакетаЭДО);
	
	ЕстьДокументыДляПодписания = Ложь;
	ЕстьДокументыДляОтправки = Ложь;
	
	ВозможныеСостояния = Перечисления.СостоянияЭДОДокументооборот;
	Для Каждого Состояние Из НаборСостоянийДокументов Цикл
		
		Если Состояние = ВозможныеСостояния.НеСформирован Тогда
			
			ЕстьДокументыДляПодписания = Истина;
			
		ИначеЕсли Состояние = ВозможныеСостояния.Подписан
			Или Состояние = ВозможныеСостояния.ПоставленВОчередьНаОтправку
			Или Состояние = ВозможныеСостояния.ОжидаетсяОтправка
			Или Состояние = ВозможныеСостояния.ОжидаетСозданияПакетаЭДО Тогда
			
			ЕстьДокументыДляОтправки = Истина;
			
		Иначе
			
			// В пакете есть документы, которые по своему состоянию отправлены быть не могут
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = ОтборКомандОтправкиПакета(ЕстьДокументыДляПодписания, ЕстьДокументыДляОтправки);
	
	УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
	
КонецПроцедуры

// Набор состояний документов пакета.
// 
// Параметры:
//  ИдентификаторПакета - УникальныйИдентификатор - Идентификатор пакета
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.СостоянияЭДОДокументооборот
//
Функция НаборСостоянийДокументовПакета(ИдентификаторПакета)
	
	НаборСостояний = Новый Массив; // Массив Из ПеречислениеСсылка.СостоянияЭДОДокументооборот
	
	ИдентификаторыПакетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПакета);
	СостоянияДокументовПакетов = ОбменСКонтрагентамиДОСлужебный.СостоянияДокументовПакетовЭДО(ИдентификаторыПакетов);
	
	УникальныеСостояния = Новый Соответствие();
	
	Для Каждого ЭлементПакета Из СостоянияДокументовПакетов Цикл
		
		СостоянияПоДокументам = ЭлементПакета.Значение;
		
		Для Каждого ЭлементДокумента Из СостоянияПоДокументам Цикл
			
			Состояние = ЭлементДокумента.Значение;
			УникальныеСостояния[Состояние] = Истина
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Элемент Из УникальныеСостояния Цикл
		Состояние = Элемент.Ключ; // ПеречислениеСсылка.СостоянияЭДОДокументооборот
		НаборСостояний.Добавить(Состояние);
	КонецЦикла;
	
	Возврат НаборСостояний;
	
КонецФункции

Функция ОтборКомандОтправкиПакета(ЕстьДокументыКПодписанию, ЕстьДокументыКОтправке)
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().НаправленияОбъекта;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДопустимыеНаправленияЭДО().Исходящий;
	Отбор.Добавить(ЭлементОтбора);
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Объект;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно;
	ЭлементОтбора.Значение = ОбъектыЭДО().Пакет;
	Отбор.Добавить(ЭлементОтбора);
	
	Если ЕстьДокументыКПодписанию Тогда
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Подписать;
		Отбор.Добавить(ЭлементОтбора);
		
	ИначеЕсли ЕстьДокументыКОтправке Тогда
		
		ГруппаОтбора = НовыйЭлементОтбораКомандЭДО();
		ГруппаОтбора.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИ;
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().НеСодержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Подписать;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Отправить;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
		Отбор.Добавить(ГруппаОтбора);
		
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

Процедура ВключитьВидимостьПрочихКомандИсходящегоДокумента(Форма, ОписаниеКоманд)
	
	Если Не ДляСостоянияДокументаЕстьПрочиеКоманды(Форма.СостояниеПоЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = ОтборПрочихКомандЭДОИсходящегоДокумента(Форма.СостояниеПоЭДО);
	
	УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
	
КонецПроцедуры

Функция ДляСостоянияДокументаЕстьПрочиеКоманды(Состояние)
	
	Возврат Состояние = Перечисления.СостоянияЭДОДокументооборот.ОшибкаПередачи;
	
КонецФункции

Функция ОтборПрочихКомандЭДОИсходящегоДокумента(Состояние)
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().НаправленияОбъекта;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДопустимыеНаправленияЭДО().Исходящий;
	Отбор.Добавить(ЭлементОтбора);
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Объект;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно;
	ЭлементОтбора.Значение = ОбъектыЭДО().Документ;
	Отбор.Добавить(ЭлементОтбора);
	
	ВозможныеСостояния = Перечисления.СостоянияЭДОДокументооборот;
	
	Если Состояние = ВозможныеСостояния.ОшибкаПередачи Тогда
		
		ГруппаОтбора = НовыйЭлементОтбораКомандЭДО();
		ГруппаОтбора.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИли;
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().ЗакрытьПринудительно;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().ПоставитьВОчередьОтправки;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
		Отбор.Добавить(ГруппаОтбора);
		
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

#КонецОбласти

#Область ВходящиеДокументы

Процедура ВключитьВидимостьКомандПоВходящим(Форма, ОписаниеКоманд)
	
	Если ЗначениеЗаполнено(Форма.ИдентификаторПакетаЭДО) Тогда
		
		ВключитьВидимостьКомандВходящегоПакета(Форма, ОписаниеКоманд);
		
	Иначе
		
		ВключитьВидимостьКомандПоВходящемуДокументу(Форма, ОписаниеКоманд);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВключитьВидимостьКомандПоВходящемуДокументу(Форма, ОписаниеКоманд, ТолькоДополнительные = Ложь)
	
	Если Не ЗначениеЗаполнено(Форма.ДокументЭДО)
		Или ТипЗнч(Форма.ДокументЭДО) <> Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваИСостояниеДокумента = СвойстваИСостояниеВходящегоДокументаЭДО(Форма.ДокументЭДО);
	ДействияДляДокументаЭДО = ЭлектронныеДокументыЭДО.ДействияПоСостояниюДокумента(
		СвойстваИСостояниеДокумента.Состояние, СвойстваИСостояниеДокумента.СвойстваДокумента);
	
	Отбор = ОтборКомандВходящегоДокументаПоДействиямИСостояниюДокументаЭДО(
		ДействияДляДокументаЭДО, СвойстваИСостояниеДокумента.Состояние, ТолькоДополнительные);
	
	УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, Истина);
	
КонецПроцедуры

Функция СвойстваИСостояниеВходящегоДокументаЭДО(ДокументЭДО)
	
	СвойстваИСостояние = Новый Структура();
	
	СвойстваДокумента = Новый Структура();
	СвойстваДокумента.Вставить("Ссылка", Документы.ЭлектронныйДокументВходящийЭДО.ПустаяСсылка());
	СвойстваДокумента.Вставить("НаОзнакомлении", Ложь);
	СвойстваДокумента.Вставить("СпособОбмена", Перечисления.СпособыОбменаЭД.ПустаяСсылка());
	СвойстваДокумента.Вставить("ВидДокумента", Справочники.ВидыДокументовЭДО.ПустаяСсылка());
	
	СвойстваИСостояние.Вставить("СвойстваДокумента", СвойстваДокумента);
	
	СвойстваИСостояние.Вставить("Состояние", РегламентыЭДО.НачальноеСостояниеДокумента());
	
	Выборка = ВыборкаПоСвойствамИСостояниюДокумента(ДокументЭДО);
	
	Если Не Выборка.Следующий() Тогда
		Возврат СвойстваИСостояние;
	КонецЕсли;
	
	СвойстваДокумента.Ссылка = Выборка.Ссылка;
	СвойстваДокумента.НаОзнакомлении = Выборка.НаОзнакомлении;
	СвойстваДокумента.СпособОбмена = Выборка.СпособОбмена;
	СвойстваДокумента.ВидДокумента = Выборка.ВидДокумента;
	
	Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
		СвойстваИСостояние.Состояние = Выборка.Состояние;
	КонецЕсли;
	
	Возврат СвойстваИСостояние;
	
КонецФункции

// Выборка по свойствам и состоянию документа.
// 
// Параметры:
//  ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Документ ЭДО
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * Ссылка - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//    * НаОзнакомлении - Булево
//    * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//    * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//    * Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО
//
Функция ВыборкаПоСвойствамИСостояниюДокумента(ДокументЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК Ссылка,
		|	ЭлектронныйДокументВходящийЭДО.НаОзнакомлении КАК НаОзнакомлении,
		|	ЭлектронныйДокументВходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ПустаяСсылка)) КАК Состояние
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка = &ДокументЭДО";
	Запрос.УстановитьПараметр("ДокументЭДО", ДокументЭДО);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ОтборКомандВходящегоДокументаПоДействиямИСостояниюДокументаЭДО(Действия, Состояние, ТолькоДополнительные)
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Объект;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно;
	ЭлементОтбора.Значение = ОбъектыЭДО().Документ;
	Отбор.Добавить(ЭлементОтбора);
	
	Если ТолькоДополнительные Тогда
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().СкрыватьВОднородномПакете;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно;
		ЭлементОтбора.Значение = Ложь;
		Отбор.Добавить(ЭлементОтбора);
		
	КонецЕсли;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбораВходящихПоДействиямИСостоянию(Действия, Состояние) Цикл
		Отбор.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	Возврат Отбор;
	
КонецФункции

// Элементы отбора входящих по действиям и состоянию.
// 
// Параметры:
//  Действия - см. ЭлектронныеДокументыЭДО.ДействияПоСостояниюДокумента
//  Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО - Состояние
// 
// Возвращаемое значение:
//  Массив из см. НовыйЭлементОтбораКомандЭДО
Функция ЭлементыОтбораВходящихПоДействиямИСостоянию(Действия, Состояние)
	
	ЭлементыОтбора = НовыеЭлементыОтбораВходящихДокументовПоДействиямИСостоянию();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().НаправленияОбъекта;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
	ЭлементОтбора.Значение = ДопустимыеНаправленияЭДО().Входящий;
	ЭлементыОтбора.Добавить(ЭлементОтбора);
	
	ГруппаОтбораДействий = НовыйЭлементОтбораКомандЭДО();
	ГруппаОтбораДействий.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИли;
	
	Если ОбменСКонтрагентамиДОСлужебныйКлиентСервер.ВходящийДокументМожноПринять(Действия, Состояние) Тогда
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Принять;
		ГруппаОтбораДействий.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
	КонецЕсли;
	
	Если ОбменСКонтрагентамиДОСлужебныйКлиентСервер.ВходящийДокументМожноОтклонить(Действия, Состояние) Тогда
		
		ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = ДействияКомандЭДО().Отклонить;
		ГруппаОтбораДействий.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
	КонецЕсли;
	
	ЭлементыОтбора.Добавить(ГруппаОтбораДействий);
	
	Возврат ЭлементыОтбора;
	
КонецФункции

Процедура ВключитьВидимостьКомандВходящегоПакета(Форма, ОписаниеКоманд)
	
	ДанныеПакета = ОбменСКонтрагентамиДОСлужебный.ДанныеПакетаДокументов(Форма.ИдентификаторПакетаЭДО);
	Если ДанныеПакета.Направление <> Перечисления.НаправленияЭДО.Входящий Тогда
		Возврат;
	КонецЕсли;
	
	СостоянияДокументов = ПакетыДокументовЭДО.СостоянияДокументовПакета(ДанныеПакета.ИдентификаторПакетаБЭД);
	СостояниеПакета = ПакетыДокументовЭДО.СостояниеПакета(СостоянияДокументов);
	СостояниеПакетаОднородно = ЗначениеЗаполнено(СостояниеПакета);
	
	Если СостояниеПакетаОднородно Тогда
		
		СвойстваИСостояниеДокумента = СвойстваИСостояниеВходящегоДокументаЭДО(Форма.ДокументЭДО);
		ДействияДляПакетаЭДО = ЭлектронныеДокументыЭДО.ДействияПоСостояниюДокумента(
			СостояниеПакета, СвойстваИСостояниеДокумента.СвойстваДокумента);
		
		Отбор = ОтборКомандВходящегоПакетаПоДействиямИСостояниюДокументаЭДО(ДействияДляПакетаЭДО, СостояниеПакета);
		
		ДоступныКомандыПакета = Не Форма.ПакетЭДОНеОтражен;
		
		УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Истина, ДоступныКомандыПакета);
		
		// Только дополнительные команды для документа
		ВключитьВидимостьКомандПоВходящемуДокументу(Форма, ОписаниеКоманд, Истина);
		
	Иначе
		
		// Если пакет не однороден, то действие по каждому документу индивидуально, показываем как для обычного документа.
		ВключитьВидимостьКомандПоВходящемуДокументу(Форма, ОписаниеКоманд);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтборКомандВходящегоПакетаПоДействиямИСостояниюДокументаЭДО(Действия, Состояние)
	
	Отбор = НовыйОтборКомандЭДО();
	
	ЭлементОтбора = НовыйЭлементОтбораКомандЭДО();
	ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Объект;
	ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно;
	ЭлементОтбора.Значение = ОбъектыЭДО().Пакет;
	Отбор.Добавить(ЭлементОтбора);
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбораВходящихПоДействиямИСостоянию(Действия, Состояние) Цикл
		Отбор.Добавить(ЭлементОтбора);
	КонецЦикла;
	
	Возврат Отбор;
	
КонецФункции

// Новые элементы отбора входящих документов по действиям и состоянию.
// 
// Возвращаемое значение:
//  Массив Из см. НовыйЭлементОтбораКомандЭДО
Функция НовыеЭлементыОтбораВходящихДокументовПоДействиямИСостоянию()
	
	Возврат Новый Массив();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОтборыКоманд

// Команда соответствует отбору.
// 
// Параметры:
//  ОписаниеКоманды - см. НовоеОписаниеКомандыПоЭДО
//  Отбор - см. НовыйОтборКомандЭДО
// 
// Возвращаемое значение:
//  Булево
Функция КомандаСоответствуетОтбору(ОписаниеКоманды, Отбор)
	
	Для Каждого Элемент Из Отбор Цикл
		
		Если Не КомандаСоответствуетЭлементуОтбора(ОписаниеКоманды, Элемент) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Команда соответствует элементу отбора.
// 
// Параметры:
//  ОписаниеКоманды см. НовоеОписаниеКомандыПоЭДО
//  ЭлементОтбора см. НовыйЭлементОтбораКомандЭДО
// 
// Возвращаемое значение:
//  Булево
Функция КомандаСоответствуетЭлементуОтбора(ОписаниеКоманды, ЭлементОтбора)
	
	Если ЭлементОтбора.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().Элемент Тогда
		
		Возврат КомандаСоответствуетПростомуЭлементуОтбора(ОписаниеКоманды, ЭлементОтбора);
		
	ИначеЕсли ЭлементОтбора.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИ Тогда
		
		Для Каждого ДочернийЭлемент Из ЭлементОтбора.ДочерниеЭлементы Цикл
			Если Не КомандаСоответствуетЭлементуОтбора(ОписаниеКоманды, ДочернийЭлемент) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Истина;
		
	ИначеЕсли ЭлементОтбора.ВидЭлемента = ВидыЭлементовОтбораКомандЭДО().ГруппаПоИли Тогда
		
		Для Каждого ДочернийЭлемент Из ЭлементОтбора.ДочерниеЭлементы Цикл
			Если КомандаСоответствуетЭлементуОтбора(ОписаниеКоманды, ДочернийЭлемент) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Ложь;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Указан некорректный вид отбора команд ЭДО'");
		
	КонецЕсли;
	
КонецФункции

Функция КомандаСоответствуетПростомуЭлементуОтбора(ОписаниеКоманды, ЭлементОтбора)
	
	Если ЭлементОтбора.ВидЭлемента <> ВидыЭлементовОтбораКомандЭДО().Элемент Тогда
		ВызватьИсключение НСтр("ru = 'Указан некорректрый вид отбора команд ЭДО'");
	КонецЕсли;
	
	Если ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Область
		Или ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().Объект
		Или ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().СкрыватьВОднородномПакете Тогда
		
		Если ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Равно Тогда
			Возврат (ОписаниеКоманды[ЭлементОтбора.Ключ] = ЭлементОтбора.Значение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().НеРавно Тогда
			Возврат (ОписаниеКоманды[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение);
		Иначе
			ВызватьИсключение НСтр("ru = 'Некорректный вид сравнения отбора команд ЭДО для указанного ключа'");
		КонецЕсли;
		
	ИначеЕсли ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().ВыполняемыеДействия
		Или ЭлементОтбора.Ключ = КлючиОтбораКомандЭДО().НаправленияОбъекта Тогда
		
		Если ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().Содержит Тогда
			Возврат (ОписаниеКоманды[ЭлементОтбора.Ключ][ЭлементОтбора.Значение] = Истина);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидыСравненияЭлементовОтбораКомандЭДО().НеСодержит Тогда
			Возврат (ОписаниеКоманды[ЭлементОтбора.Ключ][ЭлементОтбора.Значение] <> Истина);
		Иначе
			ВызватьИсключение НСтр("ru = 'Некорректный вид сравнения отбора команд ЭДО для указанного ключа'");
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Некорректный ключ отбора команд ЭДО'");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
